label masturbation:
    $ clrscr()
    if player.getLust() >= 100:
        jump madness
    else:
        $ changetime(15)
        $ tryEvent('loc_mastur')
        
label madness:
    python:
        player.incEnergy(1000)
        advancetime(1)
        player.incLust(-200)
        player.applyEffects({concentrationCure:50})
        player.reset()
    show expression 'images/events/home/madness_1.png' as tempPic
    player.say '{color=#fff782}Я вся горела от возбуждения. Даже не понимая, что происходит, я рухнула на ближайший стул и запустила в свою, истекающую влагой, киску сразу два пальца, которые проскользнули в жадную щель без всякого сопротивления. Я начала буквально трахать себя рукой.'
    play movie 'images/events/home/madness.webm' loop
    show movie with dissolve
    player.say '{color=#fff782}Мои пальчики жадно ныряли в пышущую пещерку. По стулу стекали густые выделения, медленно падая на пол длинными каплями. Небольшая хижина наполнилась мускусным запахом, и моими стонами, а в голове плавал розовый туман.'
    player.say '{color=#fff782}Мои движения всё ускорялись, я ощущала как пальцы теребят заветную точку где-то в глубине влагалища, от которой всё тело становилось ватным и невесомым. Живот безумно ходил вверх и вниз, едва поспевая за дыханием, я ощущала, что наступающий оргазм буквально выворачивает меня наизнанку.'
    show expression 'images/events/home/madness_2.png' as tempPic
    stop movie
    hide movie
    player.say '{color=#fff782}Я опустила вторую руку и в почти бессознательном состоянии дотронулась до своего клитора. От малейшего прикосновения киска напряглась так, что мои пальцы буквально заклинило в ней. Но секунду спустя влагалище расслабилось и вдруг напряглось снова! И опять! Каждый раз моё тело сотрясал сладкий спазм, и с губ срывался сладострастный крик. Я кончала столь долго, что осипла и перестала контролировать свои мышцы. Кажется, это продолжалось целую бесконечность, за которую я слегка оглупела от наслаждения.'
    show expression 'images/events/home/madness_3.png' as tempPic
    player.say '{color=#fff782}Еле придя в себя, я на четвереньках добралась до своей кровати и провалилась в долгий, лишённый сновидений сон во время которого моя мини оргия выветрилась из памяти.'
    $ move(curloc)
    
label event_loc_masturNight_0_1:
    python:
        player.incCorr(1)
        player.incLust(-200)
    show expression 'images/events/home/m1.png' as tempPic
    player.say '{color=#fff782}Стоило мне слегка дотронуться до себя, как влагалище тут же слегка запульсировало, и по телу растеклось наслаждение быстрого облегчения.'
    $ move(curloc)
    
label event_loc_masturNight_10_2:
    python:
        player.incCorr(1)
        player.incLust(-200)
    show expression 'images/events/home/m2.png' as tempPic
    player.say '{color=#fff782}Я аккуратно начал исследовать свою киску пальчиками, нащупывая бугорок клитора, и наслаждаясь приятными ощущениями жара, растекающегося по низу живота. Мне хватило буквально нескольких движений, чтобы киска задрожала в сладкой неге оргазма.'
    player.say '{color=#fff782}Ощутив облегчение, я нехотя остановилась, и начала одеваться.'
    $ move(curloc)
    
label event_loc_masturNight_30_3:
    python:
        player.incCorr(3)
        player.incLust(-200)
    show expression 'images/events/home/m3.png' as tempPic
    player.say '{color=#fff782}Встав на колени, поближе к свечке, чтобы получше рассмотреть себя, я опустила свою руку к паху и кончиками пальцев дотронулась до своей, истекающей влагой киски.'
    player.say '{color=#fff782}Я медленно скользила средним пальцем меж набрякших от возбуждения половых губ, с восторгом получая приятный опыт. Палец почти сразу стал скользким и начал так эротично поблёскивать в мерцающем пламени свечи, что мне захотелось его облизать. Но я сдержалась и сконцентрировавшись на своих ощущениях продолжила ласкать влажным пальчиком свой бугорок над киской.'
    show expression 'images/events/home/m3_1.png' as tempPic
    player.say '{color=#fff782}Оргазм накрыл меня незаметно. Вот я только ласкала свой клитор, наслаждаясь напрягшейся в предвкушении оргазма вагиной, и вот уже моё тело скрутила сладкая судорога неземного наслаждения, от которой закатываются глаза, и хочется визжать как кошке при случке.'
    $ move(curloc)
    
label event_loc_masturNight_50_4:
    python:
        player.incCorr(4)
        player.incLust(-200)
    show expression 'images/events/home/m4.png' as tempPic
    player.say '{color=#fff782}Широко раздвинув ноги, не теряя зазря времени, я ввела в себя два пальчика, с трудом сдерживая стон наслаждения. Отлично зная, как получить максимальное удовольствие, я ласкала упругие стенки своего влагалища, иногда проводя по ним ногтями в экстазе. Мои бёдра двигались в едином ритме с рукой, заставляя ножки то взлетать, то опускаться вниз, но я хотела ещё!'
    show expression 'images/events/home/m4_1.png' as tempPic
    player.say '{color=#fff782}Проведя правой рукой по тугому колечку ануса, я добралась до своей киски с обратной стороны, а пальцами левой руки, принялась теребить свой набухший клитор. Тело немедленно отозвалось взрывом удовольствия, а из горла вырвался полный наслаждения крик, медленно затихающий в окружающем меня лесу. Я работала непослушными руками над своей щёлкой, стараясь проникнуть как можно глубже во влажную пещерку и уже без остановки пощипывала самую чувствительную точку на теле.'
    show expression 'images/events/home/m4_2.png' as tempPic
    player.say '{color=#fff782}Тело выгнуло в оргазме, руки вцепились в блестящую от моего пота шкуру оленя, я ощущала дики сокращения внутри семя и нереальную страсть. В такт пульсирующей вагине, из меня выплеснулась тугая струя, туша свечку, и оставляя меня сотрясаться в сладострастных конвульсиях в темноте.'
    $ move(curloc)