label event_loc_houses_0_1:
    show expression 'images/events/houses/r1.png' as tempPic
    $ player.removeElexir(etheral)
    $ s1 = getChar('female','young')
    $ s2 = getChar('male','young')
    $ s3 = getChar('male')
    $ changetime(30)
    player.say '{i}Приняв зелье бесплотности, я зашла в дом и увидела, как [s1] болтала со своими родственниками. Не выдержав обсуждения урожайности капусты, вкусовых качеств трактирного пива, я покинула эту компанию.'
    $ move(curloc)
   
label event_loc_houses_0_2:
    show expression 'images/events/houses/r2.png' as tempPic
    $ player.removeElexir(etheral)
    $ s1 = getChar('female','young')
    $ changetime(30)
    $ player.incLust(5)
    player.say '{i}Пьяная [s1] валялась на волчьей шкуре, возле кровати. Её загорелая кожа влажно блестела, и по бедру стекали белёсые капли спермы. Похоже, до моего появления, женщина активно развлекалась со своим любовником прямо на полу. Я ощутила небольшое возбуждение, представляя, насколько восхитительное зрелище я пропустила.'
    $ move(curloc)
   
label event_loc_houses_0_3:
    show expression 'images/events/houses/r3.png' as tempPic
    $ player.removeElexir(etheral)
    $ changetime(30)
    player.say '{i}Я зашла в дом, но там никого не было. Пройдя по комнатам, я составила впечатление о хозяевах. Живут они явно небогато.'
    $ move(curloc)

label event_loc_houses_0_4:
    show expression 'images/events/houses/r4.png' as tempPic
    $ player.removeElexir(etheral)
    $ s1 = getChar('female','young')
    $ s2 = getChar('male')
    $ changetime(30)
    player.say '{i}Я прошла сквозь дверь, застав селян за столом, с кружками браги в руках.'
    s2.say '[s1], ты не чувствуешь, словно холодом вдруг повеяло? - спросил [s2], глядя прямо на то место, где я стояла.'
    s1.say 'Конечно чую, каждый день из-под двери дует, словно там кузнец свои меха качает! Когда ты уже порог починишь, или мне снова к Франсу идти?'
    s2.say 'Да прибью я порог, прибью, хватит дёргаться! Что я, не мужик что ли?'
    s1.say 'Да хрен тебя знает, [s2]! К своей браге ты бежишь быстрее, чем ко мне в постель!'
    player.say '{i}Они ещё долго продолжали свою перепалку, пока мне это не надоело, и я не ушла.'
    $ move(curloc)
    
label event_loc_houses_0_5:
    show expression 'images/events/houses/r5.png' as tempPic
    $ player.removeElexir(etheral)
    $ changetime(30)
    player.say '{i}Проникнув в дом, который оказался пустым, я увидела у зажжённого камина ладную табуретку, явно сработанную Франсом. Немного посидев и посмотрев на трепетание языков пламени, я так никого не дождалась и покинула дом.'
    $ move(curloc)

label event_loc_houses_0_6:
    show expression 'images/events/houses/r6.png' as tempPic
    $ player.removeElexir(etheral)
    $ s1 = getChar('female','young')
    $ s2 = getChar('male','young')
    $ player.incLust(15)
    $ changetime(30)
    player.say '{i}Решительно войдя сквозь стену в ближайшую хату, я застала хозяев за весьма нестандартным занятием.'
    s1.say 'Так ты говоришь у тебя на неё встал?'
    s2.say 'Да, жара стояла неимоверная, она в речку зашла, прямо в платье. Оно намокло и облепило всё тело. Я еле сдержался, чтобы не накинуться на неё!'
    s1.say 'Грязный, похотливый мальчишка! Ты недостоин моего тела, только ступней, которыми я хожу каждый день по земле кишащей червями и дерьмом!'
    'Несмотря на мерзкие слова, ножки селянки были довольно чистыми и ухоженными. Она весьма умело массировала твёрдый член своего приятеля.'
    s2.say 'Да, я недостоин! Накажи меня! Сделай так, чтобы ко мне не приходили греховные мысли!'
    '[s2] резко двигал бёдрами, в такт движениям своей любовницы, усиливая наслаждение от стимуляции.'
    s1.say 'Расскажи, чтобы ты с ней сделал? Расскажи, как бы ты её трахнул, грязный изменщик! - ножки женщины не останавливались ни на секунду. Она жарко шептала эти слова возлюбленному в ухо, теребя своими пальчиками его сосок.'
    s2.say 'О, я бы задрал ей подол, и всадил бы свой хер сразу, немедля, без всяких ласк! Её соки перемешались бы с моим потом, а крики были бы слышны даже в городе! Я представляю, насколько узкая у неё щель, и как сильно будет она меня обжимать! О, какое это будет наслаждение!'
    s1.say 'Заткнись, и трахни меня, нечестивый изменщик! Трахни так, как бы трахнул её! - голос женщины дрожал от возбуждения.'
    player.say '{i}Как назло, в тот момент, когда [s1] призывно раздвинула ноги перед своим суженным, я ощутила, что действие эликсира заканчивается, и поспешила покинуть хату.'
    $ move(curloc)
    
label event_loc_houses_0_7:
    player.say '{i}Увидев, как молодая парочка направляется в ближайшую хату, я последовала за ними.'
    show expression 'images/events/houses/r7.png' as tempPic
    $ player.removeElexir(etheral)
    $ s1 = getChar('female','young')
    $ s2 = getChar('male','young')
    $ player.incLust(35)
    $ changetime(30)
    s1.say 'О боже, [s2]! Ты не мог подождать, пока мы дойдём до кровати? - спросила девушка, поддаваясь напору крестьянина, и приподнимая ногу для того, чтобы он вставил в неё горячий член.'
    s2.say 'Я слишком долго ждал, пока твои родители уйдут! Давай детка, подвигай попкой!'
    player.say '{i}Я устроилась поудобней на полу и, сгорая от вожделения, стала наблюдать, как набухший член трепещет возле розоватой щёлки.'
    '[s1] негромко ойкнула, когда крепкая головка упёрлась в её бедро, но только сильнее прижалась к мужчине. Она продолжала ездить по ногам селянина вверх-вниз, всё больше выпуская его игрушку.'
    s2.say 'Я больше не могу! - простонал [s2] и единым движением погрузился во влажное лоно подруги.'
    'Поршень селянина скользил по трепещущим стенкам, заполнял собой всю глубину, таранил головкой упругую матку. И каждый удар отзывался вскриком девушки. Он всё увеличивал темп, нежно поддерживая ногу любимой. '
    player.say '{i}Они кончили одновременно, вскрикивая и с силой устремляясь навстречу друг другу. Перед моими глазами пещерка девушки превратилась в настоящий грот, заполненный смесью мужского и женского соков. В лицо мне брызнула небольшая струйка, и пролетела сквозь бесплотное тело. Головка стержня продолжала скользить внутри киски, не встречая сопротивления. Оба партнёра, тяжело дыша, остановились.'
    player.say '{i}Дрожа от возбуждения, я вскочила и покинула жилище крестьян, густо пахнувшее запахами соития.'
    $ move(curloc)
    
label event_loc_houses_0_8:
    show expression 'images/events/houses/r8.png' as tempPic
    $ player.removeElexir(etheral)
    $ s1 = getChar('female','young')
    $ s2 = getChar('male','old')
    $ s3 = getChar('male','young')
    $ s4 = getChar('male','young')
    $ changetime(30)
    s2.say 'Сын, ешь суп как следует! Что ты еле ковыряешься, смотреть противно!'
    s3.say 'А чего ты разорался?'
    s2.say 'Я разорался? Ах ты, козел! - отец влепил сыну громкую затрещину.'
    s4.say 'Батя, ну если человек не хочет есть, что ты заставляешь, да еще и бьешь? Ты же просто как тиран!'
    s2.say 'Я тиран? Ах ты, сволочь! - второй сын тоже мгновенно влетел лицом в миску с супом от мощного подзатыльника.'
    'В этот момент, стоящая у котла с супом [s1], присаживается на корточки, и закрывает голову руками.'
    s2.say '[s1], а ты чего закрылась? Ты готовишь хорошо, по ночам не шляешься, вежливая со мной всегда!'
    s1.say 'Да я знаю, что вежливая. Это я просто на всякий случай, ты же такой мудак...'
    player.say '{i} Из-за яростного крика отца, моё бесплотное тело неприятно завибрировало, и я поспешила покинуть хату.'
    $ move(curloc)
    
label event_loc_housesNight_0_1:
    show expression 'images/events/houses/rn1.png' as tempPic
    $ player.removeElexir(etheral)
    $ s1 = getChar('female','young')
    $ s2 = getChar('male','young')
    $ changetime(30)
    player.say '{i}Несмотря на позднюю ночь, [s2] сидел у стола, только закончив пересчитывать деньги. Его глаза пусто смотрели в никуда, словно вопрошая: "Как жить дальше?".'
    $ move(curloc)
    
label event_loc_housesNight_0_2:
    show expression 'images/events/houses/rn2.png' as tempPic
    $ player.removeElexir(etheral)
    $ s1 = getChar('female','young')
    $ s2 = getChar('male','young')
    $ changetime(30)
    player.say '{i}Когда я вошла, [s1] безмятежно лежала рядом с сопящим во сне мужем, мечтательно болтая ножками в воздухе, видимо вспоминая о чём то приятном.'
    $ move(curloc)
